In [1]:
import sqlalchemy as sa

## Query String

In [2]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Employees')
%load_ext sql
%sql $engine.url

In [3]:
%%sql 
SELECT * 
FROM employees 
LIMIT 10

 * postgresql://postgres:***@localhost:5432/Employees
10 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)),
 (10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28)),
 (10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1)),
 (10005, datetime.date(1955, 1, 21), 'Kyoichi', 'Maliniak', 'M', datetime.date(1989, 9, 12)),
 (10006, datetime.date(1953, 4, 20), 'Anneke', 'Preusig', 'F', datetime.date(1989, 6, 2)),
 (10007, datetime.date(1957, 5, 23), 'Tzvetan', 'Zielinski', 'F', datetime.date(1989, 2, 10)),
 (10008, datetime.date(1958, 2, 19), 'Saniya', 'Kalloufi', 'M', datetime.date(1994, 9, 15)),
 (10009, datetime.date(1952, 4, 19), 'Sumant', 'Peac', 'F', datetime.date(1985, 2, 18)),
 (10010, datetime.date(1963, 6, 1), 'Duangkaew', 'Piveteau', 'F', datetime.date(1989, 8, 24))]

In [4]:
%%sql
SELECT * FROM departments;

 * postgresql://postgres:***@localhost:5432/Employees
9 rows affected.

[('d001', 'Marketing'),
 ('d002', 'Finance'),
 ('d003', 'Human Resources'),
 ('d004', 'Production'),
 ('d005', 'Development'),
 ('d006', 'Quality Management'),
 ('d007', 'Sales'),
 ('d008', 'Research'),
 ('d009', 'Customer Service')]

In [5]:
%%sql
-- rename column
SELECT emp_no as "Employee #", 
       birth_date as "Birthdat", 
       first_name as "First Name" 
FROM employees
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
5 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi'),
 (10002, datetime.date(1964, 6, 2), 'Bezalel'),
 (10003, datetime.date(1959, 12, 3), 'Parto'),
 (10004, datetime.date(1954, 5, 1), 'Chirstian'),
 (10005, datetime.date(1955, 1, 21), 'Kyoichi')]

## Aggregate Function

In [6]:
%%sql
-- column concatenation
-- use single quote (' ') for text in concat
SELECT CONCAT(emp_no, ' is a ', title) as "Employee Titles" from titles
limit 5

 * postgresql://postgres:***@localhost:5432/Employees
5 rows affected.

[('10001 is a Senior Engineer',),
 ('10002 is a Staff',),
 ('10003 is a Senior Engineer',),
 ('10004 is a Engineer',),
 ('10004 is a Senior Engineer',)]

In [7]:
%%sql
SELECT emp_no, CONCAT(first_name, ' ', last_name) as "full name" from employees
limit 5

 * postgresql://postgres:***@localhost:5432/Employees
5 rows affected.

[(10001, 'Georgi Facello'),
 (10002, 'Bezalel Simmel'),
 (10003, 'Parto Bamford'),
 (10004, 'Chirstian Koblick'),
 (10005, 'Kyoichi Maliniak')]

In [8]:
%%sql
-- aggregate function
SELECT count(emp_no) FROM employees

 * postgresql://postgres:***@localhost:5432/Employees
1 rows affected.

[(300024,)]

In [9]:
%%sql
SELECT max(salary) FROM salaries

 * postgresql://postgres:***@localhost:5432/Employees
1 rows affected.

[(158220,)]

In [10]:
%%sql
SELECT sum(salary) FROM salaries

 * postgresql://postgres:***@localhost:5432/Employees
1 rows affected.

[(181480757419,)]

## Filter

In [11]:
%%sql
-- fillter
select first_name, last_name FROM employees
WHERE first_name = 'Mayumi' AND last_name = 'Schueller'

 * postgresql://postgres:***@localhost:5432/Employees
1 rows affected.

[('Mayumi', 'Schueller')]

In [12]:
%%sql
-- and, or operation order
select first_name, last_name, gender, hire_date FROM employees
WHERE (first_name = 'Georgi' AND last_name = 'Facello' AND hire_date = '1986-06-26') OR (first_name = 'Bezalel' AND last_name = 'Simmel')
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
2 rows affected.

[('Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 ('Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21))]

In [13]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Store')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [14]:
%%sql

SELECT firstname, lastname, gender, state FROM customers
WHERE (state = 'OR' or state = 'NY') AND gender = 'F'
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
5 rows affected.

[('NPSFGQ', 'NAYJFNKHRQ', 'F', 'NY'),
 ('IIGRBQ', 'OUCWDXMWAB', 'F', 'NY'),
 ('YFHHCI', 'VZVOWBWKTG', 'F', 'NY'),
 ('LQPAAP', 'PHCMXEWHIV', 'F', 'OR'),
 ('RSCFDI', 'RXUAFLXMNX', 'F', 'NY')]

## NOT

In [15]:
%%sql

SELECT COUNT(*) FROM customers
WHERE NOT age = 55
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
1 rows affected.

[(19716,)]

## Comparison

In [16]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Store')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [17]:
%%sql

SELECT COUNT(firstName)
FROM customers
WHERE gender = 'F' and state = 'OR'
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
1 rows affected.

[(106,)]

In [18]:
%%sql

SELECT COUNT(income)
FROM customers
WHERE age > 44 and income >= 100000
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
1 rows affected.

[(2497,)]

In [19]:
%%sql

SELECT COUNT(income)
FROM customers
WHERE age >= 30 and age <= 50 AND income < 50000
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
1 rows affected.

[(2362,)]

In [20]:
%%sql

SELECT AVG(income)
FROM customers
WHERE age > 20 and age < 50
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
1 rows affected.

[(Decimal('59409.926240780098'),)]

## BETWEEN .. AND ..

In [21]:
%%sql

SELECT *
FROM customers
WHERE age BETWEEN 30 AND 50 AND income < 50000
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
5 rows affected.

[(4, 'XMFYXD', 'WQLQHUHLFE', '9862764981 Dell Way', None, 'HOKEXCD', 'MS', 78442, 'US', 1, 'WQLQHUHLFE@dell.com', '9862764981', 5, '7160005148965866', '2009/09', 'user4', 'password', 44, 40000, 'F'),
 (10, 'FUOHXX', 'WMOEHWMMWM', '2603867587 Dell Way', None, 'HERSDPM', 'TN', 75182, 'US', 1, 'WMOEHWMMWM@dell.com', '2603867587', 2, '5486729339230806', '2008/02', 'user10', 'password', 44, 40000, 'M'),
 (32, 'HEJLWR', 'UKDLCPZCWE', '1184575169 Dell Way', None, 'UIKLNTZ', 'WI', 17967, 'US', 1, 'UKDLCPZCWE@dell.com', '1184575169', 1, '9080948004499080', '2012/01', 'user32', 'password', 48, 20000, 'F'),
 (33, 'UQBLKL', 'PVOFURBZMJ', '1806894893 Dell Way', None, 'JYXCXWE', 'VT', 93580, 'US', 1, 'PVOFURBZMJ@dell.com', '1806894893', 5, '9715552329085768', '2010/01', 'user33', 'password', 31, 40000, 'M'),
 (66, 'ONGTCS', 'UDVEXRMKNH', '2559052903 Dell Way', None, 'ERFGEQD', 'ND', 62223, 'US', 1, 'UDVEXRMKNH@dell.com', '2559052903', 1, '2450195379555225', '2011/11', 'user66', 'password', 39, 40000, 'F')]

In [22]:
%%sql

SELECT AVG(income)
FROM customers
WHERE age BETWEEN 20 AND 50
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
1 rows affected.

[(Decimal('59361.925908612832'),)]

## IN keyword

In [23]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Employees')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [24]:
%%sql


select * FROM employees
WHERE emp_no IN (100001, 100006, 11008)
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
3 rows affected.

[(11008, datetime.date(1962, 7, 11), 'Gennady', 'Menhoudj', 'M', datetime.date(1988, 9, 18)),
 (100001, datetime.date(1953, 2, 7), 'Jasminko', 'Antonakopoulos', 'M', datetime.date(1994, 12, 25)),
 (100006, datetime.date(1956, 7, 13), 'Janalee', 'Himler', 'F', datetime.date(1986, 1, 15))]

In [25]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Store')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [26]:
%%sql

SELECT COUNT(orderid) 
FROM orders
WHERE customerid IN (7888, 1082, 12808, 9623)
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
1 rows affected.

[(6,)]

In [27]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/World')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [28]:
%%sql

SELECT COUNT(id)
FROM city
WHERE district IN ('Zuid-Holland', 'Noord-Brabant', 'Utrecht')
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
 * postgresql://postgres:***@localhost:5432/World
1 rows affected.

[(12,)]

## LIKE

In [29]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Employees')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [30]:
%%sql

SELECT * FROM employees
WHERE first_name LIKE 'G%r'
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(10202, datetime.date(1956, 1, 5), 'Greger', 'Lichtner', 'M', datetime.date(1991, 10, 6)),
 (10321, datetime.date(1955, 12, 12), 'Guenter', 'Ravishankar', 'M', datetime.date(1991, 9, 24)),
 (10399, datetime.date(1957, 6, 13), 'Guenter', 'Marchegay', 'F', datetime.date(1985, 5, 7)),
 (10422, datetime.date(1954, 6, 2), 'Greger', 'Rubsam', 'F', datetime.date(1990, 12, 7)),
 (10719, datetime.date(1959, 9, 26), 'Guenter', 'Karunanithi', 'F', datetime.date(1995, 9, 5))]

In [31]:
%%sql

SELECT * FROM employees
WHERE first_name LIKE 'g%r'
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
0 rows affected.

[]

In [32]:
%%sql

SELECT * FROM employees
WHERE first_name ILIKE 'g%r_'
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(10133, datetime.date(1963, 12, 12), 'Giri', 'Isaak', 'M', datetime.date(1985, 12, 15)),
 (10541, datetime.date(1955, 11, 5), 'Godehard', 'Eiter', 'M', datetime.date(1986, 2, 28)),
 (10595, datetime.date(1964, 12, 10), 'Giri', 'Undy', 'M', datetime.date(1989, 11, 24)),
 (10703, datetime.date(1958, 6, 13), 'Giri', 'Baumann', 'F', datetime.date(1996, 5, 12)),
 (10828, datetime.date(1962, 10, 12), 'Godehard', 'Gammage', 'M', datetime.date(1986, 2, 14))]

## Date and Timezones

In [33]:
%%sql

SHOW TIMEZONE

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
1 rows affected.

[('Asia/Bangkok',)]

In [34]:
%%sql

-- CREATE TABLE timezones (
--   ts TIMESTAMP WITHOUT TIME ZONE,
--   tz TIMESTAMP WITH TIME ZONE
-- )

In [67]:
%%sql

-- INSERT INTO timezones VALUES(
--    TIMESTAMP WITHOUT TIME ZONE '2000-01-01 10:00:00-05',
--    TIMESTAMP WITH TIME ZONE '2000-01-01 10:00:00-05'
-- )

In [68]:
%%sql

SELECT * FROM timezones

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
1 rows affected.

[(datetime.datetime(2000, 1, 1, 10, 0), datetime.datetime(2000, 1, 1, 22, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))))]

In [37]:
%%sql
SELECT now() - '1800/01/01';

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
1 rows affected.

[(datetime.timedelta(days=81357, seconds=46185, microseconds=799189),)]

In [38]:
%%sql
SELECT EXTRACT (DAY FROM date '1992/11/13') AS DAY;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
1 rows affected.

[(Decimal('13'),)]

In [39]:
%%sql

SELECT DATE_TRUNC ('week', date '1992/11/13');

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
1 rows affected.

[(datetime.datetime(1992, 11, 9, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))),)]

In [40]:
%%sql

SELECT EXTRACT (
  year
  FROM INTERVAL '5 years 20 months'
)

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
1 rows affected.

[(Decimal('6'),)]

In [41]:
%%sql

-- DB: Employees
-- Table: employees
-- Get me all the employees above 60, use the appropriate date functions
SELECT AGE(birth_date), * FROM employees
WHERE (
   EXTRACT (YEAR FROM AGE(birth_date))
) > 60 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(datetime.timedelta(days=25214), 10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (datetime.timedelta(days=22929), 10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28)),
 (datetime.timedelta(days=24970), 10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1)),
 (datetime.timedelta(days=24706), 10005, datetime.date(1955, 1, 21), 'Kyoichi', 'Maliniak', 'M', datetime.date(1989, 9, 12)),
 (datetime.timedelta(days=25346), 10006, datetime.date(1953, 4, 20), 'Anneke', 'Preusig', 'F', datetime.date(1989, 6, 2))]

In [42]:
%%sql

-- alternative
SELECT count(birth_date) FROM employees
WHERE birth_date < now() - interval '61 years' -- 61 years before the current date
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
1 rows affected.

[(223344,)]

In [43]:
%%sql

-- How many employees where hired in February?
SELECT count(emp_no) FROM employees
where EXTRACT (MONTH FROM hire_date) = 2;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
1 rows affected.

[(24448,)]

In [44]:
%%sql

-- How many employees were born in november?
SELECT COUNT(emp_no) FROM employees
WHERE EXTRACT (MONTH FROM birth_date) = 11;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
1 rows affected.

[(24500,)]

In [45]:
%%sql
-- Who is the oldest employee?
SELECT MAX(AGE(birth_date)) FROM employees;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
1 rows affected.

[(datetime.timedelta(days=25790),)]

In [46]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Store')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [47]:
%%sql

-- How many orders were made in January 2004?
SELECT COUNT(orderid)
FROM orders
WHERE DATE_TRUNC('month', orderdate) = date '2004-01-01';

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
1 rows affected.

[(1000,)]

## DISTINCT

In [48]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Employees')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [49]:
%%sql
-- What unique titles do we have?
SELECT DISTINCT title FROM titles

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
7 rows affected.

[('Engineer',),
 ('Senior Engineer',),
 ('Manager',),
 ('Assistant Engineer',),
 ('Staff',),
 ('Senior Staff',),
 ('Technique Leader',)]

In [50]:
%%sql
-- How many unique birth dates are there?
SELECT COUNT(DISTINCT birth_date)
from employees;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
1 rows affected.

[(4750,)]

In [51]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/World')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [52]:
%%sql
-- Can I get a list of distinct life expectancy ages
-- Make sure there are no nulls

SELECT DISTINCT lifeexpectancy FROM country
WHERE lifeexpectancy IS NOT NULL
ORDER BY lifeexpectancy
LIMIT 5;

   postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
 * postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(37.2,), (37.5,), (37.6,), (37.8,), (38.3,)]

## Sorting Data

In [53]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Employees')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [54]:
%%sql
-- Sort employees by first name ascending and last name descending

SELECT * FROM employees
ORDER BY first_name ASC, last_name DESC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(444117, datetime.date(1956, 10, 22), 'Aamer', 'Zongker', 'F', datetime.date(1994, 12, 11)),
 (409151, datetime.date(1958, 10, 28), 'Aamer', 'Zizka', 'F', datetime.date(1997, 10, 6)),
 (254901, datetime.date(1957, 5, 2), 'Aamer', 'Zedlitz', 'M', datetime.date(1997, 2, 18)),
 (73804, datetime.date(1954, 4, 16), 'Aamer', 'Zallocco', 'M', datetime.date(1993, 8, 13)),
 (416885, datetime.date(1952, 6, 29), 'Aamer', 'Zaccaria', 'M', datetime.date(1991, 3, 5))]

In [55]:
%%sql
-- Sort employees by age
SELECT * FROM employees
ORDER BY birth_date

LIMIT 5;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(91374, datetime.date(1952, 2, 1), 'Eishiro', 'Kuzuoka', 'M', datetime.date(1992, 2, 12)),
 (207658, datetime.date(1952, 2, 1), 'Kiyokazu', 'Whitcomb', 'M', datetime.date(1988, 7, 26)),
 (65308, datetime.date(1952, 2, 1), 'Jouni', 'Pocchiola', 'M', datetime.date(1985, 3, 10)),
 (87461, datetime.date(1952, 2, 1), 'Moni', 'Decaestecker', 'M', datetime.date(1986, 10, 6)),
 (237571, datetime.date(1952, 2, 1), 'Ronghao', 'Schaad', 'M', datetime.date(1988, 7, 10))]

In [56]:
%%sql
-- Sort employees who's name starts with a "k" by hire_date

SELECT * FROM employees
WHERE first_name ILIKE 'k%'
ORDER BY hire_date
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(110303, datetime.date(1956, 6, 8), 'Krassimir', 'Wegerle', 'F', datetime.date(1985, 1, 1)),
 (98636, datetime.date(1952, 12, 15), 'Kannan', 'Mahnke', 'M', datetime.date(1985, 2, 1)),
 (235752, datetime.date(1964, 8, 2), 'Kwangsub', 'Selenyi', 'F', datetime.date(1985, 2, 2)),
 (89618, datetime.date(1962, 12, 28), 'Keung', 'Peak', 'F', datetime.date(1985, 2, 2)),
 (297022, datetime.date(1960, 2, 19), 'Kousuke', 'Swist', 'M', datetime.date(1985, 2, 2))]

## Multi Table Select

### Inner Join

In [57]:
%%sql

SELECT  a.emp_no,
        CONCAT(a.first_name, a.last_name) as "name",
        b.salary
FROM employees as a
INNER JOIN salaries as b ON b.emp_no = a.emp_no
ORDER BY a.emp_no
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(10001, 'GeorgiFacello', 60117),
 (10001, 'GeorgiFacello', 62102),
 (10001, 'GeorgiFacello', 66074),
 (10001, 'GeorgiFacello', 66596),
 (10001, 'GeorgiFacello', 66961)]

In [58]:
%%sql

SELECT  a.emp_no,
        CONCAT(a.first_name, a.last_name) as "name",
        b.salary,
        c.title,
        c.from_date AS "promote on"
FROM employees as a
INNER JOIN salaries as b ON a.emp_no = b.emp_no
INNER JOIN titles as c 
  ON a.emp_no = c.emp_no
  AND c.from_date = (b.from_date + interval '2 days')
ORDER BY a.emp_no
LIMIt 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(10004, 'ChirstianKoblick', 60770, 'Senior Engineer', datetime.date(1995, 12, 1)),
 (10005, 'KyoichiMaliniak', 88063, 'Senior Staff', datetime.date(1996, 9, 12)),
 (10007, 'TzvetanZielinski', 70220, 'Senior Staff', datetime.date(1996, 2, 11)),
 (10009, 'SumantPeac', 80944, 'Senior Engineer', datetime.date(1995, 2, 18)),
 (10012, 'PatricioBridgland', 54794, 'Senior Engineer', datetime.date(2000, 12, 18))]

In [59]:
%%sql

SELECT  a.emp_no,
        CONCAT(a.first_name, a.last_name) as "name",
        b.salary,
        c.title,
        c.from_date AS "promote on"
FROM employees as a
INNER JOIN salaries as b ON a.emp_no = b.emp_no
INNER JOIN titles as c 
  ON a.emp_no = c.emp_no
  AND (
  b.from_date = c.from_date
  OR c.from_date = (b.from_date + interval '2 days')
  )
ORDER BY a.emp_no
LIMIt 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(10001, 'GeorgiFacello', 60117, 'Senior Engineer', datetime.date(1986, 6, 26)),
 (10002, 'BezalelSimmel', 65828, 'Staff', datetime.date(1996, 8, 3)),
 (10003, 'PartoBamford', 40006, 'Senior Engineer', datetime.date(1995, 12, 3)),
 (10004, 'ChirstianKoblick', 40054, 'Engineer', datetime.date(1986, 12, 1)),
 (10004, 'ChirstianKoblick', 60770, 'Senior Engineer', datetime.date(1995, 12, 1))]

### Outer Join

In [60]:
%%sql
-- count employee that are not manager
SELECT COUNT(emp.emp_no)
FROM employees AS emp
LEFT JOIN dept_manager AS dep ON emp.emp_no = dep.emp_no
WHERE dep.emp_no IS NULL

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
1 rows affected.

[(300000,)]

In [61]:
%%sql

SELECT  a.emp_no,
        CONCAT(a.first_name, a.last_name) as "name",
        b.salary,
        COALESCE(c.title, 'No title change'),
        COALESCE(c.from_date::text, '-') AS "title taken on"
FROM employees AS a
INNER JOIN salaries AS b ON a.emp_no = b.emp_no
LEFT JOIN titles AS c
ON c.emp_no = a.emp_no AND (
   c.from_date = (b.from_date + interval '2 days') OR
   c.from_date = b.from_date
)
ORDER BY a.emp_no
LIMIT 40

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
40 rows affected.

[(10001, 'GeorgiFacello', 60117, 'Senior Engineer', '1986-06-26'),
 (10001, 'GeorgiFacello', 62102, 'No title change', '-'),
 (10001, 'GeorgiFacello', 66074, 'No title change', '-'),
 (10001, 'GeorgiFacello', 66596, 'No title change', '-'),
 (10001, 'GeorgiFacello', 66961, 'No title change', '-'),
 (10001, 'GeorgiFacello', 71046, 'No title change', '-'),
 (10001, 'GeorgiFacello', 74333, 'No title change', '-'),
 (10001, 'GeorgiFacello', 75286, 'No title change', '-'),
 (10001, 'GeorgiFacello', 75994, 'No title change', '-'),
 (10001, 'GeorgiFacello', 76884, 'No title change', '-'),
 (10001, 'GeorgiFacello', 80013, 'No title change', '-'),
 (10001, 'GeorgiFacello', 81025, 'No title change', '-'),
 (10001, 'GeorgiFacello', 81097, 'No title change', '-'),
 (10001, 'GeorgiFacello', 84917, 'No title change', '-'),
 (10001, 'GeorgiFacello', 85112, 'No title change', '-'),
 (10001, 'GeorgiFacello', 85097, 'No title change', '-'),
 (10001, 'GeorgiFacello', 88958, 'No title change', '-'),
 (10002, 'BezalelSimmel', 65828, 'Staff', '1996-08-03'),
 (10002, 'BezalelSimmel', 65909, 'No title change', '-'),
 (10002, 'BezalelSimmel', 67534, 'No title change', '-'),
 (10002, 'BezalelSimmel', 69366, 'No title change', '-'),
 (10002, 'BezalelSimmel', 71963, 'No title change', '-'),
 (10002, 'BezalelSimmel', 72527, 'No title change', '-'),
 (10003, 'PartoBamford', 40006, 'Senior Engineer', '1995-12-03'),
 (10003, 'PartoBamford', 43616, 'No title change', '-'),
 (10003, 'PartoBamford', 43466, 'No title change', '-'),
 (10003, 'PartoBamford', 43636, 'No title change', '-'),
 (10003, 'PartoBamford', 43478, 'No title change', '-'),
 (10003, 'PartoBamford', 43699, 'No title change', '-'),
 (10003, 'PartoBamford', 43311, 'No title change', '-'),
 (10004, 'ChirstianKoblick', 40054, 'Engineer', '1986-12-01'),
 (10004, 'ChirstianKoblick', 42283, 'No title change', '-'),
 (10004, 'ChirstianKoblick', 42542, 'No title change', '-'),
 (10004, 'ChirstianKoblick', 46065, 'No title change', '-'),
 (10004, 'ChirstianKoblick', 48271, 'No title change', '-'),
 (10004, 'ChirstianKoblick', 50594, 'No title change', '-'),
 (10004, 'ChirstianKoblick', 52119, 'No title change', '-'),
 (10004, 'ChirstianKoblick', 54693, 'No title change', '-'),
 (10004, 'ChirstianKoblick', 58326, 'No title change', '-'),
 (10004, 'ChirstianKoblick', 60770, 'Senior Engineer', '1995-12-01')]

### uncommon join

In [72]:
%%sql

-- CREATE TABLE "cartesianA" (id INT);
-- CREATE TABLE "cartesianB" (id INT);

-- INSERT INTO "cartesianA" VALUES (1);
-- INSERT INTO "cartesianA" VALUES (2);
-- INSERT INTO "cartesianA" VALUES (3);

-- INSERT INTO "cartesianB" VALUES (1);
-- INSERT INTO "cartesianB" VALUES (2);
-- INSERT INTO "cartesianB" VALUES (20);
-- INSERT INTO "cartesianB" VALUES (30);

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
(psycopg2.ProgrammingError) can't execute an empty query
[SQL: -- CREATE TABLE "cartesianA" (id INT);
-- CREATE TABLE "cartesianB" (id INT);

-- INSERT INTO "cartesianA" VALUES (1);
-- INSERT INTO "cartesianA" VALUES (2);
-- INSERT INTO "cartesianA" VALUES (3);

-- INSERT INTO "cartesianB" VALUES (1);
-- INSERT INTO "cartesianB" VALUES (2);
-- INSERT INTO "cartesianB" VALUES (20);
-- INSERT INTO "cartesianB" VALUES (30);]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [73]:
%%sql

SELECT * FROM "cartesianA" AS a
CROSS JOIN "cartesianB" AS b;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
12 rows affected.

[(1, 1),
 (1, 2),
 (1, 20),
 (1, 30),
 (2, 1),
 (2, 2),
 (2, 20),
 (2, 30),
 (3, 1),
 (3, 2),
 (3, 20),
 (3, 30)]

In [74]:
%%sql

SELECT * FROM "cartesianA" AS a
FULL JOIN "cartesianB" AS b ON a.id = b.id;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(1, 1), (2, 2), (3, None), (None, 20), (None, 30)]

### Exercise

In [76]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Store')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [78]:
%%sql

/*
* DB: Store
* Table: orders
* Question: Get all orders from customers who live in Ohio (OH), New York (NY) or Oregon (OR) state
* ordered by orderid
*/

SELECT c.firstname, c.lastname, o.orderid FROM orders AS o
INNER JOIN customers AS c ON o.customerid = c.customerid
WHERE c.state IN ('NY', 'OH', 'OR')
ORDER BY o.orderid
LIMIT 5;

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[('OVPMOP', 'LIZZSSPEUH', 21),
 ('NXMRSM', 'OMLTJEVRKL', 61),
 ('MTMDYO', 'JTFLKCXVWN', 73),
 ('JLVOXI', 'RKGPOJENXM', 103),
 ('TSBVZP', 'NYNLCPXJAS', 131)]

In [79]:
%%sql


/*
* DB: Store
* Table: products
* Question: Show me the inventory for each product
*/

SELECT p.prod_id, i.quan_in_stock
FROM products as p
INNER JOIN inventory AS i oN p.prod_id = i.prod_id 
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(1, 138), (2, 118), (3, 228), (4, 279), (5, 382)]

In [83]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Employees')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [85]:
%%sql

/*
* DB: Employees
* Table: employees
* Question: Show me for each employee which department they work in
*/

SELECT e.first_name, dp.dept_name
FROM employees AS e
INNER JOIN dept_emp AS de ON de.emp_no = e.emp_no
INNER JOIN departments AS dp ON dp.dept_no = de.dept_no
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[('Georgi', 'Development'),
 ('Bezalel', 'Sales'),
 ('Parto', 'Production'),
 ('Chirstian', 'Production'),
 ('Kyoichi', 'Human Resources')]

In [89]:
%%sql

SELECT  a.emp_no,
        CONCAT(a.first_name, a.last_name) as "name",
        b.salary
FROM employees as a
INNER JOIN salaries as b USING(emp_no) 
-- `USING(emp_no)` is same as `ON b.emp_no = a.emp_no`

LIMIT 5;

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(10001, 'GeorgiFacello', 60117),
 (10001, 'GeorgiFacello', 62102),
 (10001, 'GeorgiFacello', 66074),
 (10001, 'GeorgiFacello', 66596),
 (10001, 'GeorgiFacello', 66961)]

In [90]:
%%sql

SELECT e.emp_no, e.first_name, d.dept_name
FROM employees as e
INNER JOIN dept_emp AS de USING(emp_no)
INNER JOIN departments AS d USING(dept_no)
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
   postgresql://postgres:***@localhost:5432/Store
   postgresql://postgres:***@localhost:5432/World
5 rows affected.

[(10001, 'Georgi', 'Development'),
 (10002, 'Bezalel', 'Sales'),
 (10003, 'Parto', 'Production'),
 (10004, 'Chirstian', 'Production'),
 (10005, 'Kyoichi', 'Human Resources')]